{
    "comment": "Job history. Shouldn't change, but keeping in its own to avoid importing unnecessarily if it does.",
    "work": [
        {
            "entity": "Genome Studios",
            "name": "Principal Software Engineer",
            "url": "https://genomestudios.ca/",
            "startDate": "2024-01",
            "summary": "Technical architect for distributed game development studio, collaborating with team members across North America",
            "description": "Helped establish a small development studio in the gaming industry by working closely with studio founder to architect and implement technical projects, including games, supplemental engine utilities, engine features and bug fixes, and others. Worked with the Open 3D Engine (O3DE) community to submit contributions back to the project.",
            "highlights": [
                "Designed and implemented technical solutions for game development workflows",
                "Led collaboration with open source gaming engine community",
                "Developed supplementary tools using modern web technologies",
                "Directed technical solution design and engineering strategy",
                "Collaborated synchronously and asynchronously with international development team"
            ],
            "tech": {
                "cplusplus": "C++",
                "bitbucket": "Bitbucket",
                "github": "GitHub/GitHub Actions",
                "confluence": "Confluence",
                "hugo": "Hugo",
                "linux": "Linux",
                "netlify": "Netlify",
                "o3de": "Open 3D Engine",
                "cmake": "CMake",
                "python": "Python",
                "qt": "Qt",
                "vitejs": "ViteJS",
                "vuejs": "VueJS"
            }
        },
        {
            "entity": "Custom Ink",
            "name": "Senior Software Engineer",
            "url": "https://www.customink.com",
            "startDate": "2021-12",
            "endDate": "2023-12",
            "summary": "Led development in fully distributed team, collaborating with engineering teams across US and Czech Republic",
            "description": "Developed and maintained custom software to support the in-house printing facilities (IHP). Worked closely with management and user stakeholders to build software that met users' needs and made their work more efficient, while interfacing with the hardware used in the screenprinting and direct-to-garment (DTG, digital) printing process.",
            "highlights": [
                "Implemented technical solutions resulting in $650k annual cost savings through process optimization",
                "Developed new order prioritization algorithm achieving 20% efficiency increase in production workflows",
                "Modernized legacy Electron application through major version upgrades (Electron 5 to 20, React 16 to 20)",
                "Spearheaded deployment notification automation project, designing architecture and implementing core notification components",
                "Maintained strong team cohesion through effective communication practices"
            ],
            "tech": {
                "ruby": "Ruby",
                "rails": "Rails",
                "nodejs": "Node",
                "react": "React",
                "github": "GitHub",
                "docker": "Docker",
                "argocd": "Argo CD",
                "electron": "Electron",
                "circleci": "CircleCI"
            }
        },
        {
            "entity": "Rocket Code/Brand Value Accelerator",
            "name": "Senior Backend Engineer",
            "startDate": "2016-10",
            "endDate": "2018-02",
            "description": "Develop custom integrations between Shopify and other platforms using PHP. Work with front end developers to ensure proper data and data shape for front end work. Develop custom tools with PHP, Laravel, and VueJS that included Shopify integrations. Create and maintain Ruby Shopify checkout and cart scripts.",
            "highlights": [
                "Architected and implemented custom Shopify integration platform handling millions in transactions",
                "Designed scalable ETL processes for large dataset synchronization between enterprise systems",
                "Created API documentation standards and implemented OpenAPI/Swagger specifications",
                "Collaborated across distributed offices in Columbus and San Diego"
            ],
            "tech": {
                "php": "PHP",
                "laravel": "Laravel",
                "mysql": "MySQL",
                "redis": "Redis",
                "javascript": "Javascript",
                "nodejs": "Node",
                "vuejs": "VueJS",
                "github": "GitHub",
                "docker": "Docker",
                "ubuntu": "Ubuntu",
                "nginx": "Nginx"
            }
        },
        {
            "entity": "Core-Apps",
            "name": "Engineer, GoExpo Division",
            "startDate": "2014",
            "endDate": "2015",
            "summary": "Developed and maintained event management software in fully remote position",
            "description": "",
            "highlights": [
                "Implemented features for interactive trade show floor mapping and space allocation",
                "Built vendor booth assignment and management functionality using PHP/Laravel",
                "Contributed to platform allowing event planners to efficiently organize large-scale trade shows",
                "Collaborated with distributed development team to maintain and enhance core platform features"
            ],
            "tech": {
                "php": "PHP",
                "laravel": "Laravel",
                "mysql": "MySQL",
                "javascript": "Javascript"
            }
        },
        {
            "entity": "Previous Roles",
            "name": "Software Engineer",
            "startDate": "2008",
            "endDate": "2014",
            "highlights": [
                "Developed custom business applications using .NET, PHP, and JavaScript",
                "Implemented database solutions using MySQL and MSSQL",
                "Created automated testing frameworks and continuous integration pipelines"
            ]
        }
    ]
}
